Show / Hide Table of Contents
Class BeamDataEc2
Beam data Ec2
Inheritance
System.Object
BeamDataEc2
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public class BeamDataEc2
Constructors
Improve this Doc   View Source
BeamDataEc2()
constructor
Declaration
public BeamDataEc2()
Properties
Improve this Doc   View Source
BeamSpanLength
beam span lengrh - theoretical support distance
Declaration
public double BeamSpanLength { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DeflectionSheme
type of span loads
Declaration
public TypeDeflectionSheme DeflectionSheme { get; set; }
Property Value
 Type |  Description
 TypeDeflectionSheme
Improve this Doc   View Source
CheckLimitDeflection
indicator for check of limit deflection for beam span
Declaration
public bool CheckLimitDeflection { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
CheckLimitDeflRheoEffects
true for check of limit deflection for beam span from rheological effects of variable loads
Declaration
public bool CheckLimitDeflRheoEffects { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
IsAbsValueLimitDeflection
true for absolute user value of limit deflection (both - total + rheological)
Declaration
public bool IsAbsValueLimitDeflection { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
IsUserLimitDeflection
true for user value of limit deflection (both - total + rheological)
Declaration
public bool IsUserLimitDeflection { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
IsYDirectionData
true for deflection data in Y direction
Declaration
public bool IsYDirectionData { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Ln
Length of beam
Declaration
public double Ln { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
RequiredCamber
required camber
Declaration
public double RequiredCamber { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
TypeOfCalculation
there are several types of calculation
Declaration
public TypeOfCalculationDeflection TypeOfCalculation { get; set; }
Property Value
 Type |  Description
 TypeOfCalculationDeflection
Improve this Doc   View Source
TypeOfSupportLeft
Type of support on the left side
Declaration
public TypeOfSupportConditions TypeOfSupportLeft { get; set; }
Property Value
 Type |  Description
 TypeOfSupportConditions
Improve this Doc   View Source
TypeOfSupportRight
Type of support on the right side
Declaration
public TypeOfSupportConditions TypeOfSupportRight { get; set; }
Property Value
 Type |  Description
 TypeOfSupportConditions
Improve this Doc   View Source
UserLimitDeflection
user value of limit deflection - denominator - 1 / value
Declaration
public double UserLimitDeflection { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
UserLimitDeflRheoEffects
user value of limit deflection from rheological effects of variable loads - denominator - 1 / value
Declaration
public double UserLimitDeflRheoEffects { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
WidthOfSupportLeft
Width of support on the left side
Declaration
public double WidthOfSupportLeft { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
WidthOfSupportRight
Width of support on the right side
Declaration
public double WidthOfSupportRight { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source